In [ ]:
import pandas as pd

df = pd.read_csv('./titanic.csv')
df = df.dropna(subset = ['Age'])

df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
inputs = df.drop('Survived', axis = 'columns')
target = df['Survived']

In [ ]:
from sklearn.preprocessing import LabelEncoder

le_Sex = LabelEncoder()
inputs['Sex_n'] = le_Sex.fit_transform(inputs['Sex'])

In [ ]:
inputs

     PassengerId  Pclass  ... Embarked Sex_n
0              1       3  ...        S     1
1              2       1  ...        C     0
2              3       3  ...        S     0
3              4       1  ...        S     0
4              5       3  ...        S     1
..           ...     ...  ...      ...   ...
885          886       3  ...        Q     0
886          887       2  ...        S     1
887          888       1  ...        S     0
889          890       1  ...        C     1
890          891       3  ...        Q     1

[714 rows x 12 columns]

In [ ]:
inputs_n = inputs.drop(['PassengerId', 'Name', 'Sex',	
                        'SibSp', 'Parch',	'Ticket',	'Cabin', 
                        'Embarked'], axis = 'columns')

inputs_n

     Pclass   Age     Fare  Sex_n
0         3  22.0   7.2500      1
1         1  38.0  71.2833      0
2         3  26.0   7.9250      0
3         1  35.0  53.1000      0
4         3  35.0   8.0500      1
..      ...   ...      ...    ...
885       3  39.0  29.1250      0
886       2  27.0  13.0000      1
887       1  19.0  30.0000      0
889       1  26.0  30.0000      1
890       3  32.0   7.7500      1

[714 rows x 4 columns]

In [ ]:
target

0      0
1      1
2      1
3      1
4      0
      ..
885    0
886    0
887    1
889    1
890    0
Name: Survived, Length: 714, dtype: int64

In [ ]:
from sklearn import tree

clf = tree.DecisionTreeClassifier()

In [ ]:
clf.fit(inputs_n, target)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [ ]:
clf.score(inputs_n, target)

0.9845938375350141

In [ ]:
print('are the passengers in the first-class and have a female gender can survive?')
clf.predict([[1, 30, 70, 0]])

are the passengers in the first-class and have a female gender can survive?

array([1])

In [ ]:
print('is the passengers in the first-class and have a male gender can survive?')
clf.predict([[1, 30, 70, 1]])

is the passengers in the first-class and have a male gender can survive?

array([0])

In [ ]:
print('are the passengers in the second-class and have a female gender can survive?')
clf.predict([[2, 30, 50, 0]])

are the passengers in the second-class and have a female gender can survive?

array([1])

In [ ]:
print('are the passengers in the second-class and have a male gender can survive?')
clf.predict([[2, 30, 50, 1]])

are the passengers in the second-class and have a male gender can survive?

array([0])

In [ ]:
print('are the passengers in the third-class and have a female gender can survive?')
clf.predict([[3, 30, 30, 0]])

are the passengers in the third-class and have a female gender can survive?

array([0])

In [ ]:
print('are the passengers in the third-class and have a male gender can survive?')
clf.predict([[3, 30, 30, 1]])

are the passengers in the third-class and have a male gender can survive?

array([0])

In [ ]:
print('are the passengers in the first-class and have a female gender with the oldest age can survive?')
clf.predict([[1, 70, 100, 0]])

are the passengers in the first-class and have a female gender with the oldest age can survive?

array([1])

In [ ]:
print('are the passengers in the first-class and have a male gender with the oldest age can survive?')
clf.predict([[1, 70, 100, 1]])

are the passengers in the first-class and have a male gender with the oldest age can survive?

array([0])

In [ ]:
print('are the passengers in the first-class with the highest fare can survive?')
clf.predict([[1, 30, 500, 1]])

are the passengers in the first-class with the highest fare can survive?

array([1])

In [ ]:
print('are the passengers in the third-class with the lowest fare can survive?')
clf.predict([[3, 30, 10, 1]])

are the passengers in the third-class with the lowest fare can survive?

array([1])

In [ ]:
print('are the passengers in the first-class with the youngest age can survive?')
clf.predict([[1, 3, 100, 1]])

are the passengers in the first-class with the youngest age can survive?

array([1])